Revit 2027 API
SolidSolidCutUtils.CanElementCutElement Method
 Verifies if the cutting element can add a solid cut to the target element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanElementCutElement(
	Element cuttingElement,
	Element cutElement,
	out CutFailureReason reason
)
Public Shared Function CanElementCutElement (
	cuttingElement As Element,
	cutElement As Element,
	<OutAttribute> ByRef reason As CutFailureReason
) As Boolean
public:
static bool CanElementCutElement(
	Element^ cuttingElement,
	Element^ cutElement,
	[OutAttribute] CutFailureReason% reason
)
static member CanElementCutElement :
        cuttingElement : Element *
        cutElement : Element *
        reason : CutFailureReason byref -> bool
Parameters
cuttingElement Element
 The cutting element.
cutElement Element
 The element to be cut.
reason CutFailureReason
 The reason that the cutting element cannot add a solid cut to the cut element.
Return Value
Boolean
 True if the cutting element can add a solid cut to the target element, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
SolidSolidCutUtils Class
Autodesk.Revit.DB Namespace